                             ## CISA Code & Media Analysis ##

                            ############ README ###############
## Edit rules and queries as needed for your hunt and based on your environment.
## Ensure your EDR/SIEM instance has enough memory to run these AND/OR condition based queries. May take longer to run than conventional Sigma rule query. 
## Do not edit "logsource-product:" unless you are editing this rule to meet specific logsources/fields and know your environment.
## TLP GREEN + Please use local installation of Sigma to convert this rule.
## TLP CLEAR may convert rules using online converter of choice.
## Useful if the SIEM contains the vCenter logs.
                            ###################################

title: BRICKSTORM Backdoor Activity r2
incident: 251157.r2
tlp: CLEAR
id: 329bec83-54bd-405f-a5ab-ba97ec5e6057
status: test
description: BRICKSTORM malware is a backdoor with multiple capabilities that theat actors use to set up persistence on exploited systems. 
references:
    - https://cloud.google.com/blog/topics/threat-intelligence/brickstorm-espionage-campaign
    - https://cloud.google.com/blog/topics/threat-intelligence/ivanti-post-exploitation-lateral-movement
    - https://ctid.mitre.org/blog/2024/05/22/infiltrating-defenses-abusing-vmware-in-mitres-cyber-intrusion/
    - https://cybersecuritynews.com/new-brickstorm-stealthy-backdoor/
author: CISA Code & Media Analysis
date: 2025-09-29
modified: 2025-09-29
tags: 
    - attack.brickstorm
    - attack.unc5221
logsource:
    product: cma
detection:
    keywords_1:
        - 'vCenter'
    keywords_2:
        - 'inventory object'
        - 'object'
    keywords_3:
        - 'clone'
        - 'destroy'

    keywords_4:
        - 'GET'
        - 'POST'
        - 'PUT'
    keywords_5:
        - 'HTTP/1.1'
    keywords_6:
        - '200'
    keywords_7:
        - '/rest/com/vmware/cis/session'
        - '/rest/appliance/access/ssh'
    keywords_8:
        - 'User Agent'

    keywords_9:
        - 'sed -i'
    keywords_10:
        - 'export'
        - 'echo'
    keywords_11:
        - 'vami-lighttp'
        - '/etc/sysconfig/init'

    keywords_12:
        - 'Administrator'
    keywords_13:
        - 'Creating local person user'
        - 'Adding users'
        - 'Updating local group'
        - 'Removing principals'
        - 'Deleting principal'
    keywords_14:
        - 'PrincipalManagement'

    keywords_15:
        - 'sshd'
    keywords_16:
        - 'Postponed keyboard-interactive/pam'
        
    keywords_17:
        - '/bin/vmx'
    keywords_18:
        - '-x'
    keywords_19:
        - '/vmfs/volumes.vmx' 
    keywords_20:
        - '2>/dev/null' 
    keywords_21:
        - '0>/dev/null'

    keywords_22:
        - '$parts ='
    keywords_23:
        - 'Get-Item -Path' 
    keywords_24:
        - '"C:\Windows\System32\drivers\etc\hosts":frag*'
    keywords_25:
        - '$loader ='
    keywords_26:
        - '[IO.File]::ReadAllText'
    keywords_27:
        - 'Invoke-Expression $loader'

    keywords_28:
        - 'cp'
        - 'delete'
    keywords_29:
        - 'home/vsphere-ui/vcli'
        - '/opt/vmware/sbin'
    keywords_30:
        - 'vami-httpd'

    keywords_31:
        - 'testComputer$'
    keywords_32:
        - 'ldap-ivanti'

    keywords_33:
        - 'https://9.9.9.9/dns-query'
        - 'https://45.90.28.160/dns-query'
        - 'https://45.90.30.160/dns-query'
        - 'https://149.112.112.112/dns-query'
        - 'https://9.9.9.11/dns-query'
        - 'https://1.1.1.1/dns-query'
        - 'https://1.0.0.1/dns-query'
        - 'https://8.8.8.8/dns-query'
        - 'https://8.8.4.4/dns-query'
        - '/home/bin/netmon'
        - '/home/bin/logd'
        - '/home/runtime/logd'
        - '/home/config/logd.spec.cfg'
        - '/api/file/change-dir'
        - '/api/file/delete-dir'
        - '/api/file/delete-file'
        - '/api/file/mkdir'
        - '/api/file/list-dir'
        - '/api/file/rename'
        - '/api/file/put-file'
        - '/api/file/get-file'
        - '/api/file/slice-up'
        - '/api/file/file-md5'
        - '/api/file/up'
        - '/api/file/stat'        

    condition: keywords_1 and keywords_2 and keywords_3 or keywords_4 and keywords_5 and keywords_6 and keywords_7 and keywords_8 or keywords_9 and keywords_10 and keywords_11 or keywords_12 and keywords_13 and keywords_14 or keywords_15 and keywords_16 or keywords_17 and keywords_18 and keywords_19 and keywords_20 and keywords_21 or keywords_22 and keywords_23 and keywords_24 and keywords_25 and keywords_26 and keywords_27 or keywords_28 and keywords_29 and keywords_30 or keywords_31 and keywords_32 or keywords_33

falsepositives:
    - Rate of FP low-moderate with some strings.
    - Use this rule in an infected environment/logs.
    - Analyst may need to make adjustments to the query as required.
level: high 
